{
  "featured": true,
  "client": "Bright Pink",
  "slug": "bright-pink",
  "headline": "Inspire millennial women to assess their cancer risk",
  "campaignDescription": "Bright Pink is on a mission to help young women understand their breast and ovarian cancer risk and empower them to manage their health proactively. C&C has stood side-by-side with Bright Pink for over five years as a digital growth partner, helping to power the organization’s initiatives. Together, we’ve built and scaled a digital ad model that has inspired over 2,000,000 millennial women (and counting) to complete an online cancer risk assessment; we’ve launched Call Your Doctor Day, and brought fresh meaning to other moments in the calendar, including Mother’s Day and Ovarian and Breast Cancer Awareness Months; we’ve fueled fundraising initiatives, from the Chicago Marathon to Giving Tuesday; and we’ve used digital to connect strategically and meaningfully with diverse, high-risk communities.",
  "photo": "../../assets/img/craft/CS_HeaderImage_BP.png",
  "mainTakeaway": "Messenger lowers Cost Per Email by 150%",
  "supportiveText": "Coupled with an average of 0:38 time on content",
  "yellowBoxHeadline": "What we learned along the way",
  "yellowBoxContent": "When we began this project with Carton Council, Messenger chatbots were relatively new, and we were cautiously optimistic that it could be a good tool for this kind of information-heavy campaign where we aim to gather emails. The results far exceeded expectations, and offered a third benefit we hadn’t anticipated: it allowed us to track intent to recycle, too, opening up the possibility of personalized, ongoing recycling reminders.",
  "youtubeLink": "https://youtu.be/isfvb5ZDOCw",
  "categories": {
    "missionDelivery": true,
    "brandStorytelling": true,
    "fundraisingGrowth": true,
    "advocacyAction": false
  },
  "carousel": [
    {
      "photo": "../../assets/img/craft/ChatThumb.png",
      "header": "Starting a conversation",
      "body": "Our messenger chatbot was a popular tool that also helped verify that citizens were getting the info relevant to them, and that they had intentions to begin or get better about their recycling habits."
    }
  ],
  "clientTestimony": "With Craft & Commerce, we have been able to see our impact in real time, and know that our message is turning into action.”",
  "clientTitle": "— FIRSTNAME LASTNAME \nDIGITAL MEDIA DIRECTOR, CARTON COUNCIL",
  "pubDate": "2020-02-22T00:55:28-05:00",
  "index": 5
}
