{
  "featured": true,
  "slug": "carton-council",
  "photo": "../../assets/img/craft/CS_HeaderImage_Cartons.png",
  "youtubeLink": "",
  "categories": {
    "missionDelivery": true,
    "brandStorytelling": false,
    "fundraisingGrowth": false,
    "advocacyAction": true
  },
  "client": "Carton Council",
  "headline": "Reimagine recycling education",
  "campaignDescription": "As access to carton recycling has grown, and recycling messages--like those of seat belts and littering before them—have become so ubiquitous as to blend into one’s surroundings, Carton Council’s communication challenge has evolved from awareness of recycling to localized education on what and how to recycle. C&C embraced this new frontier by modernizing the way in which audiences engage with recycling, brought to life through an innovative, highly targeted, and localized media plan that raises awareness through platforms such as Hulu and Spotify and pulls audiences into a deeper educational experiences including native ads, Instagram Stories, and Facebook Messenger.",
  "mainTakeaway": "Messenger lowers Cost Per Email by 150%",
  "supportiveText": "Coupled with an average of 0:38 time on content",
  "carousel": [
    {
      "photo": "../../assets/img/craft/ChatThumb.png",
      "header": "Starting a conversation",
      "body": "Our messenger chatbot was a popular tool that also helped verify that citizens were getting the info relevant to them, and that they had intentions to begin or get better about their recycling habits."
    }
  ],
  "yellowBoxHeadline": "What we learned along the way",
  "yellowBoxContent": "When we began this project with Carton Council, Messenger chatbots were relatively new, and we were cautiously optimistic that it could be a good tool for this kind of information-heavy campaign where we aim to gather emails. The results far exceeded expectations, and offered a third benefit we hadn’t anticipated: it allowed us to track intent to recycle, too, opening up the possibility of personalized, ongoing recycling reminders.",
  "clientTestimony": "“With Craft & Commerce, we have been able to see our impact in real time, and know that our message is turning into action.” ",
  "clientTitle": "— FIRSTNAME LASTNAME\nDIGITAL MEDIA DIRECTOR, CARTON COUNCIL",
  "index": 5
}
