[
  {
    "id": 2,
    "photo": "../../assets/img/craft/jordan-alt.jpg",
    "name": "Jordan Ruden",
    "title": "Co-founder / Campaign Lead",
    "shortBio": "Jordan is a leading creative and technology specialist with a track record of empowering nonprofits, advocacy organizations, and purpose-driven brands to effectively harness paid media.",
    "fullBio": "Jordan is a leading creative and technology specialist with a track record of empowering nonprofits, advocacy organizations, and purpose-driven brands to effectively harness paid media, cut through today’s noisy attention landscape, and drive real-world outcomes. Prior to founding Craft & Commerce, Jordan served as a key figure at startups including GOOD, Yahoo!, and Vault—blending strategy, analytics, storytelling, and operational rigor to scale business unit growth. Overseeing award-winning campaign design and execution, Jordan has helped Girl Scouts of the USA transform its membership funnel, San Francisco MTA achieve record reductions in traffic fatalities, LA’s Measure H and California’s 3P’s realize landmark legislative victories, and Bright Pink inspire over 2 million women to assess their cancer risk.\n\nJordan holds a BFA from Ithaca College, served on NYC’s Committee for Urban Entrepreneurship, and is a sought-after trainer and speaker on digital trends and best practices."
  },
  {
    "id": 1,
    "photo": "../../assets/img/craft/mark-barker.png",
    "name": "Mark Barker",
    "title": "Co-founder / Strategy Lead",
    "shortBio": "Mark is a data-driven marketer with deep experience in integrated media strategy and social impact advertising.",
    "fullBio": "Mark is a data-driven marketer with deep experience in integrated media strategy and social impact advertising. Prior to founding Craft & Commerce, Mark was General Manager of GOOD’s digital platform and GOOD/Corps agency business, where he crafted innovative, content-based consumer engagements for the likes of Gates Foundation, Google, and Starbucks. Working within high-growth corporate divisions such as MTV Networks’ cross-property Generator unit and McCann Erickson’s TAG young adult marketing speciality—and as an independent consultant—Mark has driven measurable, meaningful business and social impact outcomes for leading startups, brands, and nonprofit organizations, including Nativo, Verizon, and the NFL.\n\nMark holds an MBA from the Acton School of Business, and a BA from Washington & Lee University. Mark is a frequent author and speaker at the intersection of purpose and performance, and serves as an advisor to several startups and community-based nonprofits."
  },
  {
    "id": 10,
    "photo": "../../assets/img/craft/Carli-SQ-1.png",
    "name": "Carli Feinstein",
    "title": "VP, Partnerships & Strategy",
    "shortBio": "Carli is an expert cause marketer and bridge-builder, who empowers Craft & Commerce's partners to achieve strategic objectives though powerful bespoke collaborations.",
    "fullBio": "Carli is an expert cause marketer and bridge-builder, who empowers Craft & Commerce's partners to achieve strategic objectives though powerful bespoke collaborations. Carli's career took off through roles in branding, sponsorship, experiential and cause marketing for personal-care logos such as TRESemme, Degree, and AXE. In 2012, Carli merged professional and personal passions when she joined national women's health nonprofit Bright Pink to oversee marketing and communications strategy and manage key partner relationships. At Craft & Commerce, Carli brings all that experience to her hand-in-hand work with clients, helping them achieve cause awareness, constituent acquisition, issue education, and social change.\n\nCarli is a founding member of Chicago's Global Shapers, a globally recognized group of young leaders empowered by the World Economic Forum to improve the lives of Chicagoans. She also serves on the advisory council for youth emotional intelligence education start-up, Odyssey. "
  },
  {
    "id": 5,
    "photo": "../../assets/img/craft/karen_2022.png",
    "name": "Karen Stransky-Price",
    "title": "Director of Operations",
    "shortBio": "Karen is a master of end-to-end digital campaign management, who stewards setup and delivery, iteration and optimization, and reporting for all Craft & Commerce partners.",
    "fullBio": "Karen is a master of end-to-end digital campaign management, who stewards setup and delivery, iteration and optimization, and reporting for all Craft & Commerce partners, while also keeping the company trains running on time. Prior to working with Craft & Commerce, Karen specialized in analytics, site management, product design, and project management for leading ecommerce and sustainability companies such as West Elm, One Kings Lane, and TerraCycle. With a prodigious depth of knowledge and a ready answer to every question, Karen oversees Craft & Commerce's work from start to finish, keeping projects on track and ensuring the achievement of strategic objectives."
  },
  {
    "id": 7,
    "photo": "../../assets/img/craft/jacob-lepiarz.png",
    "name": "Jacob Lepiarz",
    "title": "Vice President of Strategy and Insights",
    "shortBio": "Jacob is a seasoned movement-builder and cause marketing strategist with deep digital and integrated marketing expertise.",
    "fullBio": "Jacob is a seasoned movement-builder and cause marketing strategist with deep digital and integrated marketing expertise, who has developed and executed dozens of successful marketing campaigns for global nonprofits, advocacy organizations and private companies. Prior to joining Craft & Commerce, Jacob managed global cause marketing efforts for Johnson & Johnson, including the Donate a Photo app, which activated more than 250,000 people and unlocked $2.5MM+ for partner nonprofits. Jacob brings a unique skillset to Craft & Commerce, where he has led hyper-targeted advocacy campaigns for high-profile legislative efforts, conducted in-depth audience insights research for global foundations, and done digital capacity-building work for a range of partners. \n\nJacob has also worked as adjunct professor at Rutgers University, teaching the Service, Leadership, Impact course."
  },
  {
    "name": "Samantha La",
    "title": "Digital Media & Analytics Manager",
    "photo": "https://craftand.s3.amazonaws.com/samantha-sq.png",
    "shortBio": "Samantha is a self-driven and passionate team member who manages our day-to-day digital media and analytics.",
    "fullBio": "Samantha is a self-driven and passionate recent college graduate who supports the team in campaign projects. Prior to Craft & Commerce, Samantha has had experience in marketing freelancing helping businesses rebrand themselves through social media campaigns, and also graduated from Binghamton University. With her eagerness to learn and attention to detail, Samantha supports campaign strategy and planning through documenting, organizing, and actioning key items."
  },
  {
    "name": "Lizzy Toreev",
    "title": "Account Manager",
    "photo": "../../assets/img/craft/lizzy-sq-0d7bb5f-84a621c973fa6eeeaaa16f3beb090995.png",
    "shortBio": "Lizzy is an organized, detail-oriented relationship builder with experience managing a wide variety of marketing campaigns, mostly focused on the B2B market. ",
    "fullBio": "Lizzy is an organized, detail-oriented relationship builder with experience managing a wide variety of marketing campaigns, mostly focused on the B2B market. She has worked as a project manager at a creative agency in Chicago, in the development department of the University of St Andrews in Scotland, and most recently got her masters in Food Studies from the University of Exeter. At Craft and Commerce, she ensures projects run on time and have the biggest impact possible, working with clients to build a true agency partner. She loves to cook and is passionate about sustainable agriculture and food sovereignty. "
  },
  {
    "name": "Arianna Dupiton",
    "title": "Campaign Coordinator",
    "photo": "../../assets/img/craft/img_4581_square-1.jpg",
    "shortBio": ""
  },
  {
    "id": 8,
    "photo": "../../assets/img/craft/Kristin-SQ.png",
    "name": "Kristin Holzer",
    "title": "Graphic Designer",
    "shortBio": "Kristin is a versatile graphic designer who brings a diversity of experience and branding rigor to all of Craft & Commerce's design-focused projects. ",
    "fullBio": "Kristin is a versatile graphic designer who brings a diversity of experience and branding rigor to all of Craft & Commerce's design-focused projects. Prior to joining Craft & Commerce, Kristin produced work for the New York Public Library and Mount Sinai hospitals, among many others, and graduated from the Rutgers BFA program with the highest distinctions. With a dedication to collaboration with the broader creative team, Kristin elevates Craft & Commerce's visual strategy and output in support of social-impact campaigns."
  }
]
